Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectFrame.Type Property
 Gets the frame type (rectangular).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FrameTypes Type { get; }
Public ReadOnly Property Type As FrameTypes
	Get
Property Value
Type: FrameTypes
See Also
Reference
EmbeddedObjectFrame Class
Tekla.Structures.Drawing Namespace